Repository: SSanfilippo/R7.Dnn.AddUser
Catalog: R7.Dnn.AddUser/App_LocalResources/AddUser.ascx.*.resx
Languages: ru_ru

# ControlTitle_adduser.Text
source: Add User
ru_ru: Добавление пользователя

# buttonAddUser.Text
source: Add User
ru_ru: Добавить пользователя

# labelFirstName.Text
source: First Name:
ru_ru: Имя:

# labelFirstName.Help
source: Enter the first name of new user.
ru_ru: Введите имя нового пользователя.

# labelLastName.Text
source: Last Name:
ru_ru: Фамилия:

# labelLastName.Help
source: Enter the last name of new user.
ru_ru: Введите фамилию нового пользователя.

# labelOtherName.Text
source: Other Name:
ru_ru: Отчество:

# labelOtherName.Help
source: Enter the other name of new user.
ru_ru: Введите отчество нового пользователя.

# labelEmail.Text
source: Email:
ru_ru: Эл. почта:

# labelEmail.Help
source: Enter the email address of new user.
ru_ru: Введите адрес электронной почты нового пользователя.

# labelLogin.Text
source: Login:
ru_ru: Имя входа:

# labelLogin.Help
source: The autogenerated login (username) for the user.
ru_ru: Автоматически сгенерированное имя входа (логин) пользователя.

# labelPassword.Text
source: Password:
ru_ru: Пароль:

# labelPassword.Help
source: The autogenerated password for the user log in.
ru_ru: Автоматически сгенерированный пароль для входа пользователя на сайт.

# linkDone.Text
source: Done
ru_ru: Готово

# UserCreateStatus_Success.Text
source: User account created successfully. Please copy and store user credentials in a safe place.
ru_ru: Учётная запись пользователя успешно создана. Скопируйте и сохраните учетные данные в надежном месте.

# UserCreateStatus_UsernameAlreadyExists.Text
source: The account with name <strong>{0}</strong> already exists - perhaps this user has already been registered before?<br /> You could also update form fields and try again.
ru_ru: Учётная запись с именем <strong>{0}</strong> уже существует - возможно, этот пользователь уже был зарегистрирован ранее?<br /> Вы также можете изменить данные в форме и попробовать снова.

# UserCreateStatus_Other.Text
source: Error creating user account! Error message: <strong>{0}</strong>.<br /> Please contact website administrator to correct this.
ru_ru: Ошибка при создании учётной записи пользователя! Сообщение об ошибке: <strong>{0}</strong>.<br /> Чтобы исправить это, свяжитесь с администратором сайта.
