Repository: SSanfilippo/R7.Dnn.AddUser
Catalog: R7.Dnn.AddUser/App_LocalResources/EditAddUserSettings.ascx.*.resx
Languages: ru_ru

# ControlTitle_settings.Text
source: AddUser Settings
ru_ru: Настройки AddUser

# BasicSettings.Section
source: Basic Settings
ru_ru: Основные настройки

# labelDisplayNameFormat.Text
source: Display Name Format:
ru_ru: Формат отображаемого имени:

# labelDisplayNameFormat.Help
source: Format of the display name generated for user. Template variables for name parts are "FirstName", "LastName", "OtherName" and also "F.", "L.", "O." for first letters only.
ru_ru: Формат для генерации отображаемого имени пользователя. Переменные шаблона для частей имени: "FirstName", "LastName", "OtherName", а также "F.", "L.", "O." для первых букв.

# labelUserNameFormat.Text
source: Username Format:
ru_ru: Формат имени пользователя:

# labelUserNameFormat.Help
source: Format of the username generated for user. Template variables for name parts are "FirstName", "LastName", "OtherName", "Email" and also "F.", "L.", "O." for first letters only. Name parts will be transliterated and lowercased, all non-alphanumeric characters will be replaced with underscore.
ru_ru: Формат для генерации имени пользователя. Переменные шаблона для частей имени: "FirstName", "LastName", "OtherName", "Email" а также "F.", "L.", "O." для первых букв. Части имени будут транслитерированы и приведены в нижний регистр, все не буквенно-числовые символы будут заменены на знак нижнего подчеркивания.

# labelRoles.Text
source: Assign Roles to User:
ru_ru: Назначить роли:

# labelRoles.Help
source: Comma-separated list of role names to assign to newly created users. If role with specified name doesn't exists, it will be ignored.
ru_ru: Список имен ролей через запятую, которые будут назначаться вновь созданным пользователям. Если роли с таким именем не существует, она будет проигнорирована.

# labelDoneUrl.Text
source: Redirect to URL on Done:
ru_ru: По завершении перенаправлять на URL:

# labelDoneUrl.Help
source: The custom URL to redirect after user was created. {userId}, {tabId} and {portalId} template variables supported. If "Open in Popup" checked, the URL will be opened in DNN popup (providing that popups are enabled in site settings).
ru_ru: Пользовательский URL, по которому следует перенаправлять запрос после успешного создания пользователя. Поддерживаются переменные шаблона {userId}, {tabId} и {portalId}. Если отмечен флаг "Открыть во всплывающем окне", то URL будет открыт во всплывающем окне DNN (при условии, что всплывающие окна включены в настройках сайта).

# checkDoneUrlOpenInPopup.Text
source: Open in Popup
ru_ru: Открыть во всплывающем окне
